[
  {
    "name": "Boba Fett Carbine EE-4",
    "url": "https://images.limewomen.com/img/lists/0/15-most-powerful-weapons-star-wars-ranked-from-strongest-weakest_1.jpg",
    "this":"Like the sawn-off shotgun, the EE-3 and EE-4 carbine was a shortened version of the original blaster rifle. This carbine, favored by bounty hunters in the EU and used in Star Wars cannons, was made by BlasTech Industries.\n\nThe two most famous bounty hunters who used this unique weapon were Sugi (a female Zabrak bounty hunter) during the Clone Wars and Boba Fett during the Galactic Civil War."
  },

  {
    "name": "Ezra Bridger's Lightsaber",
    "url": "https://images.limewomen.com/img/lists/0/15-most-powerful-weapons-star-wars-ranked-from-strongest-weakest_2.jpg",
    "this":"Ezra Bridger's light gun from Star Wars Rebels is a one-of-a-kind weapon designed to suit his personal fighting style. What makes this weapon so powerful is that it is a lightsaber combined with a blaster.\n\nFor thousands of years, both the Jedi and the Sith have neglected blasters. However, Ezra, who is not an official Jedi, liked to use a lightsaber or a blaster for various scenarios."
  },

  {
    "name": "Thermal detonator",
    "url": "https://images.limewomen.com/img/lists/0/15-most-powerful-weapons-star-wars-ranked-from-strongest-weakest_3.jpg",
    "this":"Manufactured by BlasTech Industries and Merr-Sonn Munitions, Inc., the thermal detonator was an extremely powerful handheld explosive device.\n\nClassified as a Class A weapon, the most standard model used was the Baradium N-20 core thermal detonator. The palm-sized detonator could only be turned off by the user who activated it.\n\nThe thermal detonator was usually silver or brown in color and only fired after the owner detonated it. They were easy to carry and had a lot of power for the different scenarios one might find oneself in. The likelihood of one of them failing prematurely was unlikely due to their very robust outer core.\n\n"
  },

  {
    "name": "Ahsoka Tano Dual Blades",
    "url": "https://images.limewomen.com/img/lists/0/15-most-powerful-weapons-star-wars-ranked-from-strongest-weakest_4.jpg",
    "this":"Undoubtedly one of the baddest female characters in the Star Wars franchise, Ahsoka created twin-bladed lightsabers after leaving the Jedi Order. She intended to live like a normal person, but ended up being targeted by the Sixth Inquisitor Brother for random acts of kindness. Defeating him without a weapon of her own, she constructed twin blades.\n\nEach blade had a curved hilt, which she wielded in Shien's unusual reverse grip style. One was a standard single blade and the other was a shoto-style lightsaber. The crystals came from the Sixth Brother's spinning lightsaber."
  },

  {
    "name": "PLX-1 and PLX-4 portable rocket launcher",
    "url": "https://images.limewomen.com/img/lists/0/15-most-powerful-weapons-star-wars-ranked-from-strongest-weakest_6.jpg",
    "this":"The PLX-1, manufactured by Merr-Sonn Munitions, Inc., was created at the beginning of the Clone Wars era. Produced by the tens of thousands, they were used as powerful anti-vehicle or anti-theft weapons.\n\nIt was small enough to be carried by a single soldier, yet powerful enough to destroy an armored assault tank with a single accurate hit."
  }
]
